{
  "main": {
    "name": "Zakaria Akhfas",
    "occupation": "Junior Web Programmer && Database Administrator",
    "description": "",
    "employer": "",
    "jobDescription": "Fresh Graduate from Informatics",
    "image": "profile_pic.jpg",
    "bio": "My name is Akhfas, I'm a Junior Web Developer && Database Administration. I want to contribute with the skills I have and want to move forward with the ideas I have. I was looking for a full time job as Backend Developer and Database Developer in the Telecommunication Industry.",
    "contactmessage": "Have a project for me? Think I'd be a good fit for your team? I'd love to hear from you, give me a shout by email or by using the form below if you'd like to get in contact with me.",
    "email": "zakaria_akhfas@outlook.com",
    "phone": "+62 852-0152-5832",
    "address": {
      "street": "KP. Bendungan Melayu RT 002 RW 002 Rawa Badak Selajatan Koja Jakarta Utara",
      "city": "Jakarta",
      "state": "Indonesia",
      "zip": "14230"
    },
    "website": "http://asinau.site",
    "resumedownload": "https://drive.google.com/file/d/1emukyVBDdMMWOIc3EpkqGe2M99uMba-L/view?usp=sharing",
    "social": [
      {
        "name": "facebook",
        "url": "https://web.facebook.com/zakariaakhfas",
        "className": "fa fa-facebook"
      },
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/zakariaakhfasarrofi/",
        "className": "fa fa-linkedin"
      },
      {
        "name": "instagram",
        "url": "https://www.instagram.com/dopassss/?hl=id",
        "className": "fa fa-instagram"
      },
      {
        "name": "github",
        "url": "https://github.com/ZakariaAkhfas",
        "className": "fa fa-github"
      }
    ]
  },
  "resume": {
    "skillmessage": "I'm a tinkerer and always interested in tinkering with new technology, but it's the technology that really got me interested",
    "education": [
      {
        "school": "University Technology of Yogyakarta",
        "degree": "Bachelors Degree in Informatics, Database",
        "graduated": "March 2020",
        "description": "Here I took a Bachelor in Computer Science with a Database Specialization and achieved a much more thorough education in the theory, concepts and underlying science behind more complex programming. This is where I found my interest in application programming and the security behind computers and application systems, and found that I had the ability to understand complex algorithms."
      }
    ],
    "work": [
      {
        "company": "High School 1 Sirampog",
        "title": "Web Developer Elearning System",
        "years": "Sepetember 2019 - February 2020",
        "description": "For most of my apprenticeship in high school, I have worked as a Web Developer. Here I have had the opportunity to dig in and get my hands dirty with all the pieces of our software. I have worked with PHP assisted by CodeIgniter Framework and JavaScript"
      }
    ],
    "skills": [
      {
        "name": "Git",
        "description": "I use Git for all of my projects so far. I have used Git for version control in small teams and have toyed around with contributing to Open Source Projects.",
        "image": "git.jpg"
      },
      {
        "name": "JavaScript",
        "description": "JavaScript is the programming language I use today. This is by far the language I am most familiar with when it comes to data structures and algorithm programming",
        "image": "javascript.jpg"
      },
      {
        "name": "React JS",
        "description": "I'm fairly new to React and didn't really like it at first. It has grown on me and I will continue to use it in the future. I've created this website based on ReactJS which I use as a starting point for this personal site.",
        "image": "react.jpg"
      },
      {
        "name": "PHP",
        "description": "I enjoy MeteorJS for it's ease of configuration and its ability to get a full stack prototype up and running quickly. I used MeteorJS in a team for a Startup Programming class in UVIC in conjunction with React to build the MVP for Smirkspace (below in portfolio)",
        "image": "php.jpg"
      },
      {
        "name": "Node JS",
        "description": "Node JS is my server-side scripting language of choice. The bulk of my experience with it has been in conjunction with MeteorJS-based projects",
        "image": "node.jpg"
      },
      {
        "name": "Material UI",
        "description": "I use Material-UI more often than not when designing the layout for my sites. It is the framework I am most familiar with and can therefore design more quickly than with others.",
        "image": "materialui.jpg"
      },
      {
        "name": "MongoDB",
        "description": "I have used many different database systems and am better educated and experienced with Relational Databases. However, for many applications, the ease of use of MongoDB better suits my needs and it is much more enjoyable to work with",
        "image": "mongo.jpg"
      },
      {
        "name": "CodeIgniter",
        "description": "CodeIgniter is the first framework I use to create a website. This framework is very nice and lightweight. I like it very much.",
        "image": "codeigniter.jpg"
      }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "Airbnb-Clone",
        "category": "Clone website airbnb with React JS",
        "image": "airbnb-clone.png",
        "url": "https://airbnb-clone-e94aa.web.app/"
      },
      {
        "title": "Messager-Clone",
        "category": "Clone facebook messager using Firebase and React JS",
        "image": "messager-clone.JPEG",
        "url": "https://facebook-messeger-clone-c5635.web.app/"
      },
      {
        "title": "E-Learning System",
        "category": "Build website elearning using CodeIgniter, CSS, PHP, and template engine",
        "image": "elearning.JPG",
        "url": "https://asinau.site/index.php/login/index"
      },
      {
        "title": "Resume Website",
        "category": "A React based resume website template",
        "image": "resume-website.jpg",
        "url": "https://github.com/tbakerx/react-resume-template"
      },
      {
        "title": "Form Login",
        "category": "Create form login UI/UX using CSS and HTML",
        "image": "form-login.jpg",
        "url": "https://github.com/akhfasarrofi/form-login"
      },
      {
        "title": "Rest API",
        "category": "Create website Pizza Hutt  Rest API",
        "image": "rest-api.JPG",
        "url": "https://github.com/akhfasarrofi/rest-api-pizza-hutt"
      },
      {
        "title": "Website Landing Page",
        "category": "I created a landing page website with instructor Sandhika Galih",
        "image": "landing-page.JPG",
        "url": "https://github.com/akhfasarrofi/landing-page"
      }
    ]
  },
  "testimonials": {
    "testimonials": [
      {
        "text": "I have had the opportunity to work with Tim on multiple occasions which has always been a pleasure. He is driven and motivated with a consistently positive attitude. Tim excels at communicating with others and is always willing to work hard until he solves the problem at hand.",
        "user": "Alastair Beaumont - Web Developer at AppColony"
      }
    ]
  }
}